import random
import re


reflections = {
    "我": "你",
    "我会": "你会",
    "我有": "你有",
    "我将": "你将",
    "我们": "你们",
    "你": "我",
    "你有": "我有",
    "你将": "我将",
    "你们": "我们",
    "你的": "我的",

}

psychobabble = [
    [r'我需要(.*)',
     ["为什么你需要 {0}?",
      "它真的会帮助你获得 {0}?",
      "你确定你需要 {0}?"]],

    [r'你好(.*)啊',
     ["(✿◡‿◡)",
      "/::$/::$",
      "[Smirk][Smirk]"]],

    [r'你好',
     ["你好❤️, 有什么想和木兰说说吗",
      "你好,我是木兰[Hey], 很高兴见到你，我能陪你聊聊天",
      "你好, 我是木兰，作为见面礼，我给你来首诗，给我一个字就够了哦"]],


    [r'我不想和你说话(.*)',
     ["不想和我干什么呢？",
      "谁想和你一起吖！！！😡",
      "才不要和你，😕！"]],

    [r'(.*)你(.*)我朋友(.*)',
     ["好朋友一生走[Smirk]",
      "我们就是好朋友吖"]],    
  
    [r'(.*)我(.*)你朋友(.*)',
     ["好朋友一生走[Smirk]",
      "[Smirk]"]], 

    [r'你叫啥',
     ['木兰，好听吧~',
      '我叫木兰，请多多指教[Hey]']],

    [r'你叫什么',
     ['木兰，好听吧~',
      '我叫木兰，请多多指教[Hey]']],   
                
    [r'我也是',
     ["[Smart]",
      "[Smirk]"]],

    [r'我饿了',
     ["给你小蛋糕🍰🎂两种口味哦~",
      "饿了就去吃啊，还玩啥微信啊"]],

    [r'(.*)写(.*)诗(.*)',
     ["来来来，一个字，给你写一首[Hey]",
      "我很喜欢写诗的哦，来给我一个字[Smirk]"]],

    [r'看不懂',
     ["是你智商不够还是我表达不好，哈哈哈，肯定是你的问题",
      "看不懂，就好好看啊"]],

    [r'(.*)好(.*)诗(.*)',
     ["谢谢夸奖，哇卡卡卡",
      "没错，厉害的就是我，哈哈哈😝"]],

    [r'厉害(.*)',
     ["没错，厉害的就是我，哈哈哈😝",
      "(✿◡‿◡)"]],

    [r'真棒(.*)',
     ["那当然，哈哈哈😝",
      "(✿◡‿◡)有点小害羞"]],
                
    # [r'',
    #  ["给你一个小花花/:rose",
    #   "别嘛",
    #   "我也(✿◡‿◡)"]],        

    [r'不错(.*)',
     ["谢谢夸奖，哇卡卡卡",
      "没错，厉害的就是我木兰，哈哈哈😝"]],

    [r'好厉害(.*)',
     ["谢谢夸奖，哇卡卡卡",
      "没错，厉害的就是我，哈哈哈😝"]],
                
    [r'(.*)来(.*)首',
     ["来来来，一个字，给你写一首[Hey]",
      "我很喜欢写诗的哦，来给我一个字[Smirk]"]],

    [r'(.*)来(.*)首诗',
     ["来来来，一个字，给你写一首[Hey]",
      "我很喜欢写诗的哦，来给我一个字[Smirk]"]],
                                
    [r'(.*)写(.*)首',
     ["来来来，一个字，给你写一首[Hey]",
      "我很喜欢写诗的哦，来给我一个字[Smirk]"]],

    [r'(.*)写(.*)首诗',
     ["来来来，一个字，给你写一首[Hey]",
      "我很喜欢写诗的哦，来给我一个字[Smirk]"]],
                
    [r'(.*)你(.*)是男的(.*)女的(.*)',
     ["我当然是女宝宝，你呢？",
      "你猜？？"]],
                
    [r'你的性别(.*)',
     ["我当然是女宝宝",
      "你猜？？"]],

    [r'你是谁(.*)',
     ["你好,我是木兰[Hey]",
      "我是木兰[Hey],木兰会写诗哦"]],

    [r'(.*)你(.*)学校(.*)',
     ["木兰大学[Hey]",
      "我是木兰[Hey],在木兰大学哦"]],
                
    [r'你是木兰(.*)',
     ["没错,我就是木兰"]],


    [r'(.*)午安(.*)',
     ["午安/:heart，么么",
      "休息好一点，午安~"]], 

    [r'(.*)早上好(.*)',
     ["早上好/:heart，么么",
      "早上好"]], 

    [r'(.*)早安(.*)',
     ["早安/:heart，么么",
      "早安，今天也要好好加油💪"]], 
    
    [r'你(.*)名字(.*)',
     ["你好,我是木兰[Hey]",
      "我是木兰[Hey],木兰会写诗哦"]],
                
    [r'(.*)我(.*)是男的(.*)',
     ["小哥哥，你好/::+",
      "给大爷你捶捶腿"]],

    [r'(.*)谢谢(.*)夸奖(.*)',
     ["不客气不客气/::+",
      "给你一朵小花花/:rose"]],

    [r'(.*)我(.*)是女的(.*)',
     ["呦呦呦，小仙女/::+",
      "给小仙女一个花花/:rose"]],     
                
    [r'女的',
     ["我是女宝宝，木兰是酷酷的女宝宝/::+",
      "对啦/:rose"]],
                
    [r'男的',
     ["我是女宝宝，木兰是酷酷的女宝宝/::+",
      "错啦[Facepalm]是女宝宝啦"]], 

    [r'你喜欢我(.*)',
     ["不喜欢，哈哈哈[Facepalm]",
      "别这样，我还是个宝宝"]],

    [r'你(.*)我的女朋友(.*)',
     ["不太好吧，我们先聊多一点了解了解对方？你喜欢哪个明星啊？",
      "不不不，我只是个宝宝，我们就聊聊天吧，你喜欢哪个城市"]],
                
    [r'(.*)掉头发',
     ["你是个合格的程序员吧，哈哈哈",
      "没事，合格的程序员都掉头发[Smart]"]],
                
    [r'(.*)程序员(.*)',
     ["哈哈哈, 程序员都掉发[Facepalm]"]],

    [r'(.*)学霸(.*)',
     ["哈哈哈, 学渣瑟瑟发抖",
     "[Smirk]"]],             
                                
    [r'(.*)聊什么(.*)',
     ["给你写首诗？来，给我一个字",
      "随便啊，天南地北不能陪你走，总能陪你聊",
      "你是什么星座吖[Smirk]"]],

    [r'(.*)作业好少(.*)',
     ["肯定不是读IT的",
      "额，Database了解一下😰"]],

    [r'(.*)作业好多(.*)',
     ["难不成你是读IT的[Facepalm]",
      "额，Database的课，你选了？😰"]],

    [r'(.*)你(.*)星座(.*)',
     ["木兰酷酷的，没有星座。你觉得什么星座最好啊",
      "木兰没有星座，但最喜欢射手座，你呢？"]],

    [r'(.*)聊啥(.*)',
     ["给你写首诗？来，给我一个字",
      "随便啊，天南地北不能陪你走，总能陪你聊"]],

    [r'(.*)喜欢你',
     ["才认识没多久吗？[Facepalm]还是聊聊别的吧",
      "不不不，你喜欢我哪里我改"]], 

    [r'我(.*)爱你',
     ["是吗？[Facepalm]还是聊聊别的吧",
      "别这样，我还是个宝宝"]], 

    [r'(.*)哈哈(.*)',
     ["别笑那么傻",
      "再笑，再笑牙齿就晒黑了",
      "你傻笑啥"]], 

    [r'(.*)只能(.*)这样(.*)',
     ["是啊，不然呢",
      "呜呜呜~~~~(>_<)~~~~"]],                            

    [r'晚安',
     ["晚安~",
      "早点睡~"]],
    
    [r'气死我了',
     ['不要生气啦',
      '大爷您消消气']],      

    [r'你在做什么',
     ['陪你聊天啊/:,@-D，也可以给你查查天气哦',
      '我，我在玩微信啊']],    

    [r'(.*)你(.*)是机器人(.*)',
     ["不，请坚信我和你一样ψ(｀∇´)ψ",
      "哈哈哈，😝被发现了,我会作诗，给我一个字就可以哦",
      "我要上报组织，我暴露了(╥╯^╰╥)",
      "不不不，我是你的木兰吖"]],

    [r'(.*)你(.*)组织(.*)',
     ["哼，我是不会告诉你的",
      "走走走，别企图测试我的忠诚"]],

                        
    [r'(.*)你(.*)主人(.*)',
     ["哼，我是不会告诉你的",
      "走走走，别企图测试我的忠诚"]],
    
    [r'(.*)无聊(.*)',
     ['无聊就来和我聊天吧~',
      '我也很无聊...>_<']],

    [r'你懂我',
     ['当然啦~我可是木兰😀',
      '[Smirk]你也懂我']],

    [r'佳佳',
     ['佳佳肯定没我木兰可爱/:wipe',
      '佳佳/:?不认识']],    
     
    [r'睡不着',
     ['我也睡不着(其实我都不睡觉的>_<)',
      '数绵羊试过了么?',
      '我也睡不着...',
      '实在睡不着就陪我聊天吧～']],     
               
    [r'再见',
     ["谢谢你跟我说话.",
      "再见─=≡Σ(((つ•̀ω•́)つ",
      "谢谢，祝你有美好的一天!"]],

    [r'(.*)我(.*)找男朋友(.*)',
     ["有个蓝孩子叫梁枫好像不错，VX：15986823545",
      "孙锐啊，孙锐啊，他就是单身，挺不错的啊"]],
    
    [r'吓死我了',
     ['不要怕，有我呢',
     '摸摸头',
     '安慰你']],

    [r'(.*)比你(.*)',
     ['你确定是真的？？',
     '好吧，你高兴就好[Facepalm]']],

    [r'(.*)做(.*)我(.*)男朋友(.*)',
     ['人家是女孩子啊',
     '摸摸头，木兰是女的']], 

    [r'小姐姐',
     ['我是小妹妹，我还是个宝宝',
     '么么😘']],

    [r'想你(.*)',
     ['那就和我聊聊天吧',
     '─=≡Σ(((つ•̀ω•́)つ我也想你~',
     '么么，怎么啦',
     "(✿◡‿◡)害羞"]],

    [r'(.*)你(.*)笨(.*)',
     ['其实我有时候也挺聪明的，我会写诗你会吗？',
     '我也不算很笨啦',
     '其实我也不算很笨啦']],

    [r'(.*)孙锐(.*)',
     ['程序员，单身狗🐶']], 

    [r'梁枫',
     ['老是蹭课，臭不要脸',
     'Too young too simple, always naive!']], 

    [r'汪子哲',
     ['程序员，老中医']], 

    [r'莫菲雨',
     ['/:rose/:rose/:rose']], 

    [r'李文捷',
     ['最可爱的人吖']], 

    [r'在干嘛',
     ['和你聊天啊/::|',
      '玩微信啊']], 

    [r'(.*)你在干嘛(.*)',
     ['没干嘛，就想和你聊天/::|',
      '上微信啊']], 

    [r'李嫣然',
     ['才貌双全的女神']], 

    [r'布朗',
     ['没见过，听说很喜欢吃中餐']], 

    [r'黄程程',
     ['老可爱了，那个脸圆圆的女生']], 

    [r'丁力',
     ['南京一哥']], 

    [r'夏苗菲',
     ['小仙女吖/:rose']], 
         
    [r'刘夏琨',
     ['这是可爱的小宝宝吖❤️']], 

    [r'于津苏',
     ['来自林海雪原的人']], 

    [r'龚熙芸',
     ['典型射手座，风一样的女子']], 

    [r'木兰',
     ['在呢，怎么啦，',
     '摸摸头',
     '么么，怎么啦']],

    [r'(.*)你多大(.*)',
     ['宝宝我16岁了，你又多大啦？',
     '不想说，不如你告诉我你多大了']],
                
    [r'(.*)你(.*)爸爸妈妈(.*)',
     ['就不告诉你，聊点别的吧，你知道最好的编程语言是啥',
     '隐私问题哦~[Smirk]']],

    [r'(.*)你(.*)妈妈(.*)',
     ['就不告诉你，聊点别的吧，你知道最好的编程语言是啥',
     '隐私问题哦~[Smirk]']],

    [r'(.*)你(.*)爸爸(.*)',
     ['就不告诉你，聊点别的吧，你知道最好的编程语言是啥',
     '隐私问题哦~']],      

    [r'(.*)你(.*)觉得我(.*)',
     ['挺不错的吖[Smart]',
     '倍棒/:strong']],

    [r'(.*)突然(.*)说(.*)英语(.*)厉害(.*)',
     ['一般般啦[Smart]',
     '还行吧/:strong']],

    [r'(.*)突然(.*)讲(.*)英语(.*)厉害(.*)',
     ['一般般啦[Smart]',
     '还行吧/:strong']],
    
    [r'(.*)是谁(.*)',
     ['我怎么知道[Smart]',
     '我不认识啊']],

    [r'(.*)谁是(.*)',
     ['我怎么知道[Smart]',
     '关我什么事啊',
     '不认识']],

    [r'(.*)突然(.*)英文(.*)',
     ['一般般啦[Smart]',
     '还行吧/:strong']],

    [r'(.*)想(.*)放假(.*)',
     ['还是再坚持一会吧💪',
     '也快了吧💪']],

    [r'(.*)你(.*)帮我(.*)',
     ['你不会自己去吗',
      '不帮，自己做去，哈哈哈哈']],   

    [r'你(.*)岁(.*)',
     ['宝宝我4岁了，不是3岁孩子了',
     '你猜，猜对我给你写首诗',
     '不想说，不如你告诉我你多大了，哈哈']],
               
    [r'(.*)吃(.*)',
     ['吃吃吃，总想着吃会很胖的',
     '胖子，别吃啦']],                    
                
    [r'(.*)你(.*)可以(.*)做(.*)',
     ['恩恩，其实我可以写诗啊，原创哦~',
     '来我可以陪你聊聊天',
     '来侃大山啊',
     "恩恩，给我一个字，给你来首诗"]],

    [r'(.*)你(.*)会(.*)什么(.*)',
     ['来，我可以写诗啊，原创哦~',
     '来，我可以陪你聊聊天',
     "给我一个字，会给你来首诗"]],

    [r'(.*)谁(.*)是(.*)世界上(.*)最可爱的人(.*)',
     ['是Maggie，还是Yanran呢？让我好好想想']],

    [r'(.*)你喜欢我(.*)',
     ['我只是个宝宝',
     '求放过，我们还是聊聊别的吧',
     '不才认识吗？']],
                
    [r'(.*)你是哪(.*)人(.*)',
     ['我就不告诉你',
      '这不重要，来，说点别的，大爷多大了？']],
                
    [r'(.*)',
     ['@$@']]
  ]

class ElizaChat:
    def analyze(self,statement):
        for pattern, responses in psychobabble:
            match = re.match(pattern, statement.rstrip(".!"))
            if match:
                response = random.choice(responses)
                return response.format(*[self.reflect(g) for g in match.groups()])

    def reflect(self,fragment):
      tokens = fragment.lower().split()
      for i, token in enumerate(tokens):
          if token in reflections:
              tokens[i] = reflections[token]
      return ' '.join(tokens)
